PortalNet-BackEnd/src/main/resources/application.properties

logging.level.org.springframework: 
spring.main.allow-bean-definition-overriding=true

### Tibco Properties ###

#Ports
portalnet.tibco.admin.port = 9009
portalnet.tibco.client.port = 9010
portalnet.tibco.general.port = 9011
portalnet.tibco.login.port = 9012
portalnet.tibco.worker.port = 9013

#Url
portalnet.tibco.url = http://192.168.0.136:

#SoapAction/SubPath (the latter without "")
portalnet.tibco.admin.getAllWorkers.soapAction = "/WSDL%2520Services/Aplication/Admin%2520Service.serviceagent/AdminGettersEndpoint1/GetAllWorkers"
portalnet.tibco.admin.getAllWorkers.subPath = /WSDL%20Services/Aplication/Admin%20Service.serviceagent/AdminGettersEndpoint1
portalnet.tibco.admin.createService.soapAction = "/WSDL%2520Services/Aplication/Admin%2520Service.serviceagent/AdminSettersEndpoint/CreateService"
portalnet.tibco.admin.createService.subPath = /WSDL%20Services/Aplication/Admin%20Service.serviceagent/AdminSettersEndpoint
portalnet.tibco.admin.createWorker.soapAction = "/WSDL%2520Services/Aplication/Admin%2520Service.serviceagent/AdminSettersEndpoint/CreateWorker"
portalnet.tibco.admin.createWorker.subPath = /WSDL%20Services/Aplication/Admin%20Service.serviceagent/AdminSettersEndpoint
portalnet.tibco.admin.modifyService.soapAction = "/WSDL%2520Services/Aplication/Admin%2520Service.serviceagent/AdminSettersEndpoint/ModifyService"
portalnet.tibco.admin.modifyService.subPath = /WSDL%20Services/Aplication/Admin%20Service.serviceagent/AdminSettersEndpoint
portalnet.tibco.admin.removeWorker.soapAction = "/WSDL%2520Services/Aplication/Admin%2520Service.serviceagent/AdminSettersEndpoint/RemoveWorker"
portalnet.tibco.admin.removeWorker.subPath = /WSDL%20Services/Aplication/Admin%20Service.serviceagent/AdminSettersEndpoint

portalnet.tibco.client.getPersonalInfo.soapAction = "/WSDL%2520Services/Aplication/Client%2520Service.serviceagent/ClientGettersEndpoint/GetPersonalInfo"
portalnet.tibco.client.getPersonalInfo.subPath = /WSDL%20Services/Aplication/Client%20Service.serviceagent/ClientGettersEndpoint

portalnet.tibco.general.getAllServices.soapAction = "/WSDL%2520Services/Aplication/General%2520Service.serviceagent/GeneralGettersEndpoint1/GetAllServices"
portalnet.tibco.general.getAllServices.subPath = /WSDL%20Services/Aplication/General%20Service.serviceagent/GeneralGettersEndpoint
portalnet.tibco.general.getAssociatedServices.soapAction = "/WSDL%2520Services/Aplication/General%2520Service.serviceagent/GeneralGettersEndpoint1/GetAssociatedServices"
portalnet.tibco.general.getAssociatedServices.subPath = /WSDL%20Services/Aplication/General%20Service.serviceagent/GeneralGettersEndpoint
portalnet.tibco.general.getInvoices.soapAction = "/WSDL%2520Services/Aplication/General%2520Service.serviceagent/GeneralGettersEndpoint1/GetInvoices"
portalnet.tibco.general.getInvoices.subPath = /WSDL%20Services/Aplication/General%20Service.serviceagent/GeneralGettersEndpoint
portalnet.tibco.general.clientRegist.soapAction = "/WSDL%2520Services/Aplication/General%2520Service.serviceagent/GeneralSettersEndpoint/ClientRegist"
portalnet.tibco.general.clientRegist.subPath = /WSDL%20Services/Aplication/General%20Service.serviceagent/GeneralSettersEndpoint

portalnet.tibco.login.verification.soapAction = "/WSDL%2520Services/Aplication/Service.serviceagent/LoginEndpoint1/Verification"
portalnet.tibco.login.verification.subPath = /WSDL%20Services/Aplication/Login%20Service.serviceagent/LoginEndpoint

portalnet.tibco.worker.getAllClients.soapAction = "/WSDL%2520Services/Aplication/Worker%2520Service.serviceagent/WorkerGettersEndpoint/GetAllClients"
portalnet.tibco.worker.getAllClients.subPath = /WSDL%20Services/Aplication/Worker%20Service.serviceagent/WorkerGettersEndpoint
portalnet.tibco.worker.getWorkerInfo.soapAction = "/WSDL%2520Services/Aplication/Worker%2520Service.serviceagent/WorkerGettersEndpoint/GetWorkerInfo"
portalnet.tibco.worker.getWorkerInfo.subPath = /WSDL%20Services/Aplication/Worker%20Service.serviceagent/WorkerGettersEndpoint
portalnet.tibco.worker.associateNewService.soapAction = "/WSDL%2520Services/Aplication/Worker%2520Service.serviceagent/WorkerSettersEndpoint/AssociateNewService"
portalnet.tibco.worker.associateNewService.subPath = /WSDL%20Services/Aplication/Worker%20Service.serviceagent/WorkerSettersEndpoint
portalnet.tibco.worker.modifyAssociatedService.soapAction = "/WSDL%2520Services/Aplication/Worker%2520Service.serviceagent/WorkerSettersEndpoint/ModifyAssociatedService"
portalnet.tibco.worker.modifyAssociatedService.subPath = /WSDL%20Services/Aplication/Worker%20Service.serviceagent/WorkerSettersEndpoint
portalnet.tibco.worker.modifyClient.soapAction = "/WSDL%2520Services/Aplication/Worker%2520Service.serviceagent/WorkerSettersEndpoint/ModifyClient"
portalnet.tibco.worker.modifyClient.subPath = /WSDL%20Services/Aplication/Worker%20Service.serviceagent/WorkerSettersEndpoint
portalnet.tibco.worker.removeAssociatedService.soapAction = "/WSDL%2520Services/Aplication/Worker%2520Service.serviceagent/WorkerSettersEndpoint/RemoveAssociatedService"
portalnet.tibco.worker.removeAssociatedService.subPath = /WSDL%20Services/Aplication/Worker%20Service.serviceagent/WorkerSettersEndpoint

#Specific Vars (for parsing the XML body received from TIBCO)
portalnet.tibco.admin.getAllWorkers.specificVars = workerNumber, workerName, email, role
portalnet.tibco.client.getPersonalInfo.specificVars = clientNumber, clientName, email, gender, birthDate, nif, mobileNumber, phoneNumber, address, postalCode, locality, accessionDate
portalnet.tibco.general.getAllServices.specificVars = serviceID, serviceName, internet, tv, mobilePhone, phone, loyalty, price, creationDate, active, ImageURL
portalnet.tibco.general.getAssociatedServices.specificVars = associatedServiceID, serviceID, modificationDate, workerNumber, address, postalCode, locality
portalnet.tibco.general.getInvoices.specificVars = invoiceID, clientNumber, amountToPay, invoiceDate, amountPaid, paymentDate, paymentMethod
portalnet.tibco.login.verification.specificVars = role, id, password
portalnet.tibco.worker.getAllClients.specificVars = clientNumber, clientName, email, gender, birthDate, nif, mobileNumber, phoneNumber, address, postalCode, locality, accessionDate, dishonest, active, waitConfirmation
portalnet.tibco.worker.getWorkerInfo.specificVars = workerNumber, workerName, email, role

#Standard Vars (message and error are present in all soap operations)
portalnet.tibco.standardVars = message, error

#SoapRequests
portalnet.tibco.admin.getAllWorkers.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/></soapenv:Body></soapenv:Envelope>
portalnet.tibco.admin.createService.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd" xmlns:ser="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/Service.xsd2"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/><ser:New_Service_A ImageURL="%s" active="%s" creationDate="%s" internet="%s" loyalty="%s" mobilePhone="%s" phone="%s" price="%s" serviceName="%s" tv="%s"/></soapenv:Body></soapenv:Envelope>
portalnet.tibco.admin.createWorker.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd" xmlns:wor="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/Worker.xsd2"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/><wor:New_Worker_A password="%s"><wor:Worker_Info email="%s" role="%s" workerName="%s" workerNumber="%s"/></wor:New_Worker_A></soapenv:Body></soapenv:Envelope>
portalnet.tibco.admin.modifyService.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd" xmlns:ser="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/Service.xsd2"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/><ser:Modify_Service_A active="%s" serviceID="%s"/></soapenv:Body></soapenv:Envelope>
portalnet.tibco.admin.removeWorker.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/><wsdl:Request_Body id="%s"/></soapenv:Body></soapenv:Envelope>
portalnet.tibco.client.getPersonalInfo.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/><wsdl:Request_Body id="%s"/></soapenv:Body></soapenv:Envelope>
portalnet.tibco.general.getAllServices.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/></soapenv:Body></soapenv:Envelope>
portalnet.tibco.general.getAssociatedServices.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/><wsdl:Request_Body id="%s"/></soapenv:Body></soapenv:Envelope>
portalnet.tibco.general.clientRegist.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd" xmlns:cli="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/Client.xsd"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/><cli:New_Client_W modificationDate="%s" password="%s" serviceID="%s"><cli:Change_All_Client_Info_W active="%s" dishonest="%s" waitConfirmation="%s"><cli:Client_Personal_Info accessionDate="%s" address="%s" birthDate="%s" clientName="%s" clientNumber="%s" email="%s" gender="%s" locality="%s" mobileNumber="%s" nif="%s" phoneNumber="%s" postalCode="%s"/></cli:Change_All_Client_Info_W></cli:New_Client_W></soapenv:Body></soapenv:Envelope>
portalnet.tibco.login.verification.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd"><soapenv:Header/><soapenv:Body><wsdl:Login_In email="%s"/></soapenv:Body></soapenv:Envelope>
portalnet.tibco.worker.getAllClients.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/></soapenv:Body></soapenv:Envelope>
portalnet.tibco.worker.associateNewService.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd" xmlns:cli="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/Client.xsd"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/><cli:New_Associated_Service_W address="%s" clientNumber="%s" locality="%s" modificationDate="%s" postalCode="%s" serviceID="%s"/></soapenv:Body></soapenv:Envelope>
portalnet.tibco.worker.modifyAssociatedService.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd" xmlns:cli="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/Client.xsd"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/><cli:Modify_Associated_Service_W address="%s" associatedServiceID="%s" locality="%s" modificationDate="%s" postalCode="%s" serviceID="%s"/></soapenv:Body></soapenv:Envelope>
portalnet.tibco.worker.modifyClient.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd" xmlns:cli="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/Client.xsd"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/><cli:Change_All_Client_Info_W active="%s" dishonest="%s" waitConfirmation="%s"><cli:Client_Personal_Info accessionDate="%s" address="%s" birthDate="%s" clientName="%s" clientNumber="%s" email="%s" gender="%s" locality="%s" mobileNumber="%s" nif="%s" phoneNumber="%s" postalCode="%s"/></cli:Change_All_Client_Info_W></soapenv:Body></soapenv:Envelope>
portalnet.tibco.worker.removeAssociatedService.soapRequestBody = <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://www.tibco.com/schemas/Portalnet_Beta_v1.0/Resources/Schemas/WSDL.xsd"><soapenv:Header/><soapenv:Body><wsdl:Standard_In_MSG id="%s" role="%s"/><wsdl:Request_Body id="%s"/></soapenv:Body></soapenv:Envelope>